## Pandas Introduction

In [1]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {
    "name":['Avadhesh','Amit','Amrita','Anita'],
    "marks":[50 , 80 , 78, 90],
    "city":['Bhopal','waidhan','okhrawal','semariya'],
}

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

       name  marks      city
0  Avadhesh     50    Bhopal
1      Amit     80   waidhan
2    Amrita     78  okhrawal
3     Anita     90  semariya

##### 0 1 2 3 4 - index      name,marks,city ---> column

In [9]:
df.to_csv('Family.csv') ## write into Excel Sheet

In [ ]:
df.to_csv('Family.csv',index = False) ## Without index

In [14]:
Avadhesh = pd.read_csv('Avadhesh.csv') # read from csv file

In [15]:
Avadhesh

   Unnamed: 0    name  marks       city
0           0   ASHOK     60  singrauli
1           1  URMILA     67       mada
2           2  RAJESH     98       rewa
3           3     RAJ     65      jarha

In [16]:
Avadhesh['name']  # choose one

0     ASHOK
1    URMILA
2    RAJESH
3       RAJ
Name: name, dtype: object

In [23]:
Avadhesh['marks'][0] = 90 # Updation

C:\Users\AVADHESH KU. SHAH\AppData\Local\Temp\ipykernel_6748\1182336770.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Avadhesh['marks'][0] = 90 # Updation

In [24]:
Avadhesh

        Unnamed: 0    name  marks       city
First            0      90     90  singrauli
Second           1  URMILA     67       mada
Third            2  RAJESH     98       rewa
Fourth           3     RAJ     65      jarha

In [21]:
Avadhesh.index=['First','Second','Third','Fourth'] # index value change

In [22]:
Avadhesh

        Unnamed: 0    name  marks       city
First            0      90     60  singrauli
Second           1  URMILA     67       mada
Third            2  RAJESH     98       rewa
Fourth           3     RAJ     65      jarha

In [11]:
df.head(2)

       name  marks     city
0  Avadhesh     50   Bhopal
1      Amit     80  waidhan

In [12]:
df.tail(2)

     name  marks      city
2  Amrita     78  okhrawal
3   Anita     90  semariya

In [13]:
df.describe()

           marks
count   4.000000
mean   74.500000
std    17.156146
min    50.000000
25%    71.000000
50%    79.000000
75%    82.500000
max    90.000000

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [27]:
df.shape

(4, 3)

### Functions inbuilt

In [ ]:
df.describe()
df.meax()
df.count()
df.mean()
df.median()
df.corr()
df.min()
df.std()